
/*
树( Tree ):n ( n>=0)个节点构成的有限集合。
当n=0时，称为空树 ;
对于任一棵非空树(n>0)，它具备以下性质
树中有一个称为“根( Root )”的特殊节点，用 r表示 ;
其余节点可分为m(m>0)个互不相交的有限集T1T2，...，Tm，其中每个集合本身又是一棵树，称为原来树的“子树( SubTree )”

树的术语:
1.节点的度( Degree ) : 节点的子树个数
2.树的度: 树的所有节点中最大的度数
3.叶节点( Leaf) : 度为0的节(也称叶子)
4.父节点( Parent ) : 有子树的节点是其子树的根节点的父节点
5.子节点( Child ):若A节点是B节点的父节点，则称B节点是A节点的子节点;子节点也称孩子节点。
6.兄弟节点( Sibling ) : 具有同一父节点的各节点彼此是兄弟节点。
7.路径和路径长度: 从节点n1到nk的路径为一个节点序列n1,n2,...,nk, ni是 ni+1的父节点。路径所包含边的个数为路径的长度。
8.节点的层次( Level) : 规定根节点在1层，其它任一节点的层数是其父节点的层数加1。
9.树的深度( Depth ) : 树中所有节点中的最大层次是这棵树的深度。

*/